using Microsoft.AspNetCore.Mvc.Rendering;

namespace Overoom.Views.Content;

public static class Constants
{
    internal static readonly List<SelectListItem> Genres = new List<string>
    {
        "Аниме", "Биография", "Боевик", "Вестерн", "Военный", "Детектив", "Детский", "Документальный", "Драма", "Игра",
        "Исторический", "Комедия", "Концерт", "Короткометражка", "Криминал", "Мелодрама", "Музыкальный", "Мультфильм",
        "Мюзикл", "Новости", "Приключения", "Семейный", "Спортивный", "Ток-шоу", "Триллер", "Ужасы", "Фантастика",
        "Фильм-нуар", "Фэнтези", "Церемония"
    }.Select(x => new SelectListItem(x, x)).ToList();

    internal static readonly List<SelectListItem> Countries = new List<string>
    {
        "Россия", "СССР", "США", "Франция", "Италия", "Испания", "Великобритания", "Германия", "Корея Южная", "Япония",
        "Австралия", "Австрия", "Азербайджан", "Албания", "Алжир", "Американские Виргинские острова",
        "Американское Самоа", "Ангола", "Андорра", "Антарктида", "Антигуа и Барбуда", "Антильские Острова", "Аргентина",
        "Армения", "Аруба", "Афганистан", "Багамы", "Бангладеш", "Барбадос", "Бахрейн", "Беларусь", "Белиз", "Бельгия",
        "Бенин", "Берег Слоновой кости", "Бермуды", "Бирма", "Болгария", "Боливия", "Босния", "Босния и Герцеговина",
        "Ботсвана", "Бразилия", "Бруней-Даруссалам", "Буркина-Фасо", "Бурунди", "Бутан", "Вануату", "Ватикан",
        "Венгрия", "Венесуэла", "Виргинские Острова", "Внешние малые острова США", "Вьетнам", "Вьетнам Северный",
        "Габон", "Гаити", "Гайана", "Гамбия", "Гана", "Гваделупа", "Гватемала", "Гвинея", "Гвинея-Бисау",
        "Германия (ГДР)", "Германия (ФРГ)", "Гибралтар", "Гондурас", "Гонконг", "Гренада", "Гренландия", "Греция",
        "Грузия", "Гуам", "Дания", "Джибути", "Доминика", "Доминикана", "Египет", "Заир", "Замбия", "Западная Сахара",
        "Зимбабве", "Израиль", "Индия", "Индонезия", "Иордания", "Ирак", "Иран", "Ирландия", "Исландия", "Йемен",
        "Кабо-Верде", "Казахстан", "Каймановы острова", "Камбоджа", "Камерун", "Канада", "Катар", "Кения", "Кипр",
        "Киргизия", "Кирибати", "Китай", "Колумбия", "Коморы", "Конго", "Конго (ДРК)", "Корея", "Корея Северная",
        "Косово", "Коста-Рика", "Кот-д’Ивуар", "Куба", "Кувейт", "Лаос", "Латвия", "Лесото", "Либерия", "Ливан",
        "Ливия", "Литва", "Лихтенштейн", "Люксембург", "Маврикий", "Мавритания", "Мадагаскар", "Макао", "Македония",
        "Малави", "Малайзия", "Мали", "Мальдивы", "Мальта", "Марокко", "Мартиника", "Маршалловы острова", "Масаи",
        "Мексика", "Мелкие отдаленные острова США", "Мозамбик", "Молдова", "Монако", "Монголия", "Монтсеррат", "Мьянма",
        "Намибия", "Непал", "Нигер", "Нигерия", "Нидерланды", "Никарагуа", "Новая Зеландия", "Новая Каледония",
        "Норвегия", "ОАЭ", "Оккупированная Палестинская территория", "Оман", "Остров Мэн", "Остров Святой Елены",
        "Острова Кука", "острова Теркс и Кайкос", "Пакистан", "Палау", "Палестина", "Панама", "Папуа - Новая Гвинея",
        "Парагвай", "Перу", "Польша", "Португалия", "Пуэрто Рико", "Реюньон", "Российская империя", "Руанда", "Румыния",
        "Сальвадор", "Самоа", "Сан-Марино", "Сан-Томе и Принсипи", "Саудовская Аравия", "Свазиленд",
        "Северная Македония", "Сейшельские острова", "Сенегал", "Сент-Винсент и Гренадины", "Сент-Китс и Невис",
        "Сент-Люсия", "Сербия", "Сербия и Черногория", "Сиам", "Сингапур", "Сирия", "Словакия", "Словения",
        "Соломоновы Острова", "Сомали", "Судан", "Суринам", "Сьерра-Леоне", "Таджикистан", "Таиланд", "Тайвань",
        "Танзания", "Тимор-Лесте", "Того", "Тонга", "Тринидад и Тобаго", "Тувалу", "Тунис", "Туркменистан", "Турция",
        "Уганда", "Узбекистан", "Украина", "Уоллис и Футуна", "Уругвай", "Фарерские острова",
        "Федеративные Штаты Микронезии", "Фиджи", "Филиппины", "Финляндия", "Фолклендские острова",
        "Французская Гвиана", "Французская Полинезия", "Хорватия", "ЦАР", "Чад", "Черногория", "Чехия", "Чехословакия",
        "Чили", "Швейцария", "Швеция", "Шпицберген и Ян-Майен", "Шри-Ланка", "Эквадор", "Экваториальная Гвинея",
        "Эритрея", "Эстония", "Эфиопия", "ЮАР", "Югославия", "Югославия (ФР)", "Ямайка"
    }.Select(x => new SelectListItem(x, x)).ToList();
}